src/InformationRegisters/Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот/Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>КодНеисправнойДетали</name>
    <type>
      <types>CatalogRef.Scan_КодыНеисправныхДеталей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.Scan_ВидыСервисныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот/ManagerModule.bsl
//rarus tenkam 11.12.2017 mantis 11952 +++

Функция ПолучитьРаботыПоКоду(КодНеисправнойДетали) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот.Работа КАК Работа
	               |ИЗ
	               |	РегистрСведений.Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот КАК Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот
	               |ГДЕ
	               |	Scan_СоответствиеКодовНеисправныхДеталейИСервисныхРабот.КодНеисправнойДетали = &КодНеисправнойДетали";
	Запрос.УстановитьПараметр("КодНеисправнойДетали", КодНеисправнойДетали);
	Результат = Запрос.Выполнить();
	МассивРабот = Новый Массив;
	Если НЕ Результат.Пустой() Тогда
		МассивРабот = Результат.Выгрузить().ВыгрузитьКолонку("Работа");
	КонецЕсли;
	Возврат МассивРабот;
КонецФункции

//rarus tenkam 11.12.2017 mantis 11952 ---
